Ac6Embedded/svd-microchip/PIC32CZ_CA70/PIC32CZ2051CA70144.svd
            <register>
               <name>CMDR</name>
               <description>Command Register</description>
               <addressOffset>0x14</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CMDNB</name>
                     <description>Command Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RSPTYP</name>
                     <description>Response Type</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RSPTYPSelect</name>
                        <enumeratedValue>
                           <name>NORESP</name>
                           <description>No response</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_48_BIT</name>
                           <description>48-bit response</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_136_BIT</name>
                           <description>136-bit response</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>R1B</name>
                           <description>R1b response type</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPCMD</name>
                     <description>Special Command</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SPCMDSelect</name>
                        <enumeratedValue>
                           <name>STD</name>
                           <description>Not a special CMD.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INIT</name>
                           <description>Initialization CMD: 74 clock cycles for initialization sequence.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Synchronized CMD: Wait for the end of the current data block transfer before sending the pending command.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CE_ATA</name>
                           <description>CE-ATA Completion Signal disable Command. The host cancels the ability for the device to return a command completion signal on the command line.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IT_CMD</name>
                           <description>Interrupt command: Corresponds to the Interrupt Mode (CMD40).</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IT_RESP</name>
                           <description>Interrupt response: Corresponds to the Interrupt Mode (CMD40).</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOR</name>
                           <description>Boot Operation Request. Start a boot operation mode, the host processor can read boot data from the MMC device directly.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EBO</name>
                           <description>End Boot Operation. This command allows the host processor to terminate the boot operation mode.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OPDCMD</name>
                     <description>Open Drain Command</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>OPDCMDSelect</name>
                        <enumeratedValue>
                           <name>PUSHPULL</name>
                           <description>Push pull command.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OPENDRAIN</name>
                           <description>Open drain command.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MAXLAT</name>
                     <description>Max Latency for Command to Response</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>MAXLATSelect</name>
                        <enumeratedValue>
                           <name>_5</name>
                           <description>5-cycle max latency.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64</name>
                           <description>64-cycle max latency.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRCMD</name>
                     <description>Transfer Command</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TRCMDSelect</name>
                        <enumeratedValue>
                           <name>NO_DATA</name>
                           <description>No data transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>START_DATA</name>
                           <description>Start data transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP_DATA</name>
                           <description>Stop data transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRDIR</name>
                     <description>Transfer Direction</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TRDIRSelect</name>
                        <enumeratedValue>
                           <name>WRITE</name>
                           <description>Write.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>READ</name>
                           <description>Read.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRTYP</name>
                     <description>Transfer Type</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TRTYPSelect</name>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>MMC/SD Card Single Block</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MULTIPLE</name>
                           <description>MMC/SD Card Multiple Block</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STREAM</name>
                           <description>MMC Stream</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BYTE</name>
                           <description>SDIO Byte</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BLOCK</name>
                           <description>SDIO Block</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IOSPCMD</name>
                     <description>SDIO Special Command</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>IOSPCMDSelect</name>
                        <enumeratedValue>
                           <name>STD</name>
                           <description>Not an SDIO Special Command</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUSPEND</name>
                           <description>SDIO Suspend Command</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESUME</name>
                           <description>SDIO Resume Command</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ATACS</name>
                     <description>ATA with Command Completion Signal</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ATACSSelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal operation mode.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COMPLETION</name>
                           <description>This bit indicates that a completion signal is expected within a programmed amount of time (HSMCI_CSTOR).</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOOT_ACK</name>
                     <description>Boot Operation Acknowledge</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BLKR</name>
               <description>Block Register</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>BCNT</name>
                     <description>MMC/SDIO Block Count - SDIO Byte Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>BLKLEN</name>
                     <description>Data Block Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSTOR</name>
               <description>Completion Signal Timeout Register</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>CSTOCYC</name>
                     <description>Completion Signal Timeout Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CSTOMUL</name>
                     <description>Completion Signal Timeout Multiplier</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CSTOMULSelect</name>
                        <enumeratedValue>
                           <name>_1</name>
                           <description>CSTOCYC x 1</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16</name>
                           <description>CSTOCYC x 16</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128</name>
                           <description>CSTOCYC x 128</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256</name>
                           <description>CSTOCYC x 256</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1024</name>
                           <description>CSTOCYC x 1024</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4096</name>
                           <description>CSTOCYC x 4096</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_65536</name>
                           <description>CSTOCYC x 65536</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1048576</name>
                           <description>CSTOCYC x 1048576</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>RSPR[%s]</name>
               <description>Response Register 0</description>
               <addressOffset>0x20</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RSP</name>
                     <description>Response</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RDR</name>
               <description>Receive Data Register</description>
               <addressOffset>0x30</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Data to Read</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TDR</name>
               <description>Transmit Data Register</description>
               <addressOffset>0x34</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Data to Write</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
