Ac6Embedded/svd-microchip/PIC32CZ_CA70/PIC32CZ2051CA70144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>RTT</name>
         <version>6081M</version>
         <description>Real-time Timer</description>
         <baseAddress>0x400E1830</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>RTT</name>
            <description>Real Time Timer</description>
            <value>3</value>
         </interrupt>
         <registers>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x00</addressOffset>
               <fields>
                  <field>
                     <name>RTPRES</name>
                     <description>Real-time Timer Prescaler Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ALMIEN</name>
                     <description>Alarm Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTTINCIEN</name>
                     <description>Real-time Timer Increment Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTTRST</name>
                     <description>Real-time Timer Restart</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTTDIS</name>
                     <description>Real-time Timer Disable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC1HZ</name>
                     <description>Real-Time Clock 1Hz Clock Selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AR</name>
               <description>Alarm Register</description>
               <addressOffset>0x04</addressOffset>
               <fields>
                  <field>
                     <name>ALMV</name>
                     <description>Alarm Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VR</name>
               <description>Value Register</description>
               <addressOffset>0x08</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CRTV</name>
                     <description>Current Real-time Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>Status Register</description>
               <addressOffset>0x0C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ALMS</name>
                     <description>Real-time Alarm Status (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTTINC</name>
                     <description>Prescaler Roll-over Status (cleared on read)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SMC</name>
         <version>6498J</version>
         <description>Static Memory Controller</description>
         <baseAddress>0x40080000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xEC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <cluster>
               <dim>4</dim>
               <dimIncrement>16</dimIncrement>
               <name>SMC_CS_NUMBER[%s]</name>
               <description>SMC Setup Register</description>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>SETUP</name>
                  <description>SMC Setup Register</description>
                  <addressOffset>0x00</addressOffset>
                  <fields>
                     <field>
                        <name>NWE_SETUP</name>
                        <description>NWE Setup Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>NCS_WR_SETUP</name>
                        <description>NCS Setup Length in WRITE Access</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>NRD_SETUP</name>
                        <description>NRD Setup Length</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>NCS_RD_SETUP</name>
                        <description>NCS Setup Length in READ Access</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PULSE</name>
                  <description>SMC Pulse Register</description>
                  <addressOffset>0x04</addressOffset>
                  <fields>
                     <field>
                        <name>NWE_PULSE</name>
                        <description>NWE Pulse Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>NCS_WR_PULSE</name>
                        <description>NCS Pulse Length in WRITE Access</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>NRD_PULSE</name>
                        <description>NRD Pulse Length</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>NCS_RD_PULSE</name>
                        <description>NCS Pulse Length in READ Access</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CYCLE</name>
                  <description>SMC Cycle Register</description>
                  <addressOffset>0x08</addressOffset>
                  <fields>
                     <field>
                        <name>NWE_CYCLE</name>
                        <description>Total Write Cycle Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                     <field>
                        <name>NRD_CYCLE</name>
                        <description>Total Read Cycle Length</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MODE</name>
                  <description>SMC Mode Register</description>
                  <addressOffset>0x0C</addressOffset>
                  <fields>
                     <field>
                        <name>READ_MODE</name>
                        <description>Read Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WRITE_MODE</name>
                        <description>Write Mode</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EXNW_MODE</name>
                        <description>NWAIT Mode</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>EXNW_MODESelect</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Disabled-The NWAIT input signal is ignored on the corresponding chip select.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FROZEN</name>
                              <description>Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>READY</name>
                              <description>Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BAT</name>
                        <description>Byte Access Type</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>BATSelect</name>
                           <enumeratedValue>
                              <name>BYTE_SELECT</name>
                              <description>Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BYTE_WRITE</name>
                              <description>Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DBW</name>
                        <description>Data Bus Width</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DBWSelect</name>
                           <enumeratedValue>
                              <name>_8_BIT</name>
                              <description>8-bit Data Bus</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_16_BIT</name>
                              <description>16-bit Data Bus</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TDF_CYCLES</name>
                        <description>Data Float Time</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>TDF_MODE</name>
                        <description>TDF Optimization</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PMEN</name>
                        <description>Page Mode Enabled</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PS</name>
                        <description>Page Size</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>PSSelect</name>
                           <enumeratedValue>
                              <name>_4_BYTE</name>
                              <description>4-byte page</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_8_BYTE</name>
                              <description>8-byte page</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_16_BYTE</name>
                              <description>16-byte page</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_32_BYTE</name>
                              <description>32-byte page</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>OCMS</name>
               <description>SMC Off-Chip Memory Scrambling Register</description>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>SMSE</name>
                     <description>Static Memory Controller Scrambling Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CS0SE</name>
                     <description>Chip Select (x = 0 to 3) Scrambling Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CS1SE</name>
                     <description>Chip Select (x = 0 to 3) Scrambling Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CS2SE</name>
                     <description>Chip Select (x = 0 to 3) Scrambling Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CS3SE</name>
                     <description>Chip Select (x = 0 to 3) Scrambling Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEY1</name>
               <description>SMC Off-Chip Memory Scrambling KEY1 Register</description>
               <addressOffset>0x84</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY1</name>
                     <description>Off-Chip Memory Scrambling (OCMS) Key Part 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEY2</name>
               <description>SMC Off-Chip Memory Scrambling KEY2 Register</description>
               <addressOffset>0x88</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY2</name>
                     <description>Off-Chip Memory Scrambling (OCMS) Key Part 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>SMC Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protect Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.</description>
                           <value>0x534D43</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>SMC Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
